app/controllers/books_controller.rb

def create
#params.require(:book).permit(     :title, :desc,     author: [ :name, :email ]   )
s=Book.create(params.require(:book).permit(     :title, :desc, :author,    author_attributes: [ :name, :email ]   ))
---
INSERT INTO `authors` (`name`, `email`, `created_at`, `updated_at`, `book_id`) VALUES (' ', ' ', '2017-11-22 09:30:25', '2017-11-22 09:30:25', 56)
INSERT INTO `books` (`title`, `desc`, `created_at`, `updated_at`) VALUES ('PH ', 'Physics', '2017-11-17 05:28:57', '2017-11-17 05:28:57')

def edit
@book1= Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1

def update
@book1 = Book.find(params[:id])
@book1.update_attributes(params.require(:book).permit(:title, :desc)	)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
UPDATE `books` SET `title` = 'MT', `desc` = 'maths', `updated_at` = '2017-11-17 05:42:33' WHERE `books`.`id` = 2

def destroy
     @book1 =Book.find(params[:id])
     @book1.destroy
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 0 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 1