app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`title`, `desc`, `created_at`, `updated_at`) VALUES ('ss', 'ss', '2017-11-04 07:12:59', '2017-11-04 07:12:59')

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE `comments` SET `title` = 'rajeshs', `desc` = 'aallassss', `updated_at` = '2017-11-04 07:16:46' WHERE `comments`.`id` = 4

  def destroy
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 1

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1