app/controllers/events_controller.rb

def create
	e=Event.new
e.title=params[:event][:title]
e.desc = params[:event][:desc]
e.save
---
INSERT INTO `events` (`title`, `desc`, `created_at`, `updated_at`) VALUES ('banesh', 'kamat', '2017-11-13 09:10:21', '2017-11-13 09:10:21')

def show
@event =Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 3 LIMIT 1

def edit
@event=Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

def update
@event = Event.find(params[:id])
@event.update_attributes(params.require(:event).permit(:title, :desc)	)
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
UPDATE `events` SET `title` = NULL, `desc` = NULL, `updated_at` = '2017-11-13 16:53:34' WHERE `events`.`id` = 2