app/controllers/home_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('ddd', '2017-11-04 07:00:43', '2017-11-04 07:00:43')
---
def user
	puts params
   #@first_name = params["firstname"]
   u = User.new
   u.name = params["firstname"]
   u.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = 'rajesh', `updated_at` = '2017-11-04 07:04:14' WHERE `users`.`id` = 1
---
def update
 u = User.find(params[:id])
 u.name=params[:name]
 u.save